---
kind: method
id: M:Autodesk.Revit.DB.Transform1D.#ctor(Autodesk.Revit.DB.Transform1D)
source: html/549a29aa-19ba-1468-95c2-8303bca1d6f6.htm
---
# Autodesk.Revit.DB.Transform1D.#ctor Method

The copy constructor.

## Syntax (C#)
```csharp
public Transform1D(
	Transform1D other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Transform1D`) - The transformation to use as input.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null